In [29]:
# Dependencies and Setup
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
# from secret import username, password

In [30]:
# Study data files
imdb_movies_filepath = "data/IMDb movies.csv"
imdb_names_filepath = "data/IMDb names.csv"
imdb_ratings_filepath = "data/IMDb ratings.csv"

In [31]:
# Read the data into Pandas DataFrame
imdb_movies = pd.read_csv(imdb_movies_filepath)
imdb_names = pd.read_csv(imdb_names_filepath)
imdb_ratings = pd.read_csv(imdb_ratings_filepath)

# PERSON FILE

In [32]:
#Look at imported names CSV
imdb_names.head()

,imdb_name_id,name,birth_name,height,bio,birth_details,birth_year,date_of_birth,place_of_birth,death_details,death_year,date_of_death,place_of_death,reason_of_death,spouses,divorces,spouses_with_children,children,primary_profession,known_for_titles
0,nm0000001,Fred Astaire,Frederic Austerlitz Jr.,177.0,"Fred Astaire was born in Omaha, Nebraska, to J...","May 10, 1899 in Omaha, Nebraska, USA",1899.0,1899-05-10,"Omaha, Nebraska, USA","June 22, 1987 in Los Angeles, California, USA ...",1987.0,1987-06-22,"Los Angeles, California, USA",pneumonia,2,0,1,2,"soundtrack,actor,miscellaneous","tt0050419,tt0053137,tt0072308,tt0043044"
1,nm0000002,Lauren Bacall,Betty Joan Perske,174.0,Lauren Bacall was born Betty Joan Perske on Se...,"September 16, 1924 in The Bronx, New York City...",1924.0,1924-09-16,"The Bronx, New York City, New York, USA","August 12, 2014 in New York City, New York, US...",2014.0,2014-08-12,"New York City, New York, USA",stroke,2,1,2,3,"actress,soundtrack","tt0037382,tt0038355,tt0117057,tt0071877"
2,nm0000003,Brigitte Bardot,Brigitte Bardot,166.0,"Brigitte Bardot was born on September 28, 1934...","September 28, 1934 in Paris, France",1934.0,1934-09-28,"Paris, France",NaN,NaN,NaN,NaN,NaN,4,3,1,1,"actress,soundtrack,producer","tt0054452,tt0059956,tt0057345,tt0049189"
3,nm0000004,John Belushi,John Adam Belushi,173.0,"John Belushi was born in Chicago, Illinois, US...","January 24, 1949 in Chicago, Illinois, USA",1949.0,1949-01-24,"Chicago, Illinois, USA","March 5, 1982 in Hollywood, Los Angeles, Calif...",1982.0,1982-03-05,"Hollywood, Los Angeles, California, USA",acute cocaine and heroin intoxication,1,0,0,0,"actor,writer,soundtrack","tt0078723,tt0072562,tt0080455,tt0077975"
4,nm0000005,Ingmar Bergman,Ernst Ingmar Bergman,179.0,"Ernst Ingmar Bergman was born July 14, 1918, t...","July 14, 1918 in Uppsala, Uppsala län, Sweden",1918.0,1918-07-14,"Uppsala, Uppsala län, Sweden","July 30, 2007 in Fårö, Gotlands län, Sweden",2007.0,2007-07-30,"Fårö, Gotlands län, Sweden",NaN,5,4,5,8,"writer,director,actor","tt0050976,tt0083922,tt0069467,tt0050986"

## person table

In [33]:
# Return only wanted columns for person table
name_columns = ['imdb_name_id', 'name', 'birth_name', 'birth_year', 'death_year', 'height']
new_name_df = imdb_names[name_columns].copy()

# Rename the column headers to match ERD
transform_name_df = new_name_df.rename(columns={'imdb_name_id': 'person_id',
                                                 'name': 'person_name'})

# Drop duplicate people with same name
final_name = transform_name_df.drop_duplicates('person_name')

final_name.head()

,person_id,person_name,birth_name,birth_year,death_year,height
0,nm0000001,Fred Astaire,Frederic Austerlitz Jr.,1899.0,1987.0,177.0
1,nm0000002,Lauren Bacall,Betty Joan Perske,1924.0,2014.0,174.0
2,nm0000003,Brigitte Bardot,Brigitte Bardot,1934.0,NaN,166.0
3,nm0000004,John Belushi,John Adam Belushi,1949.0,1982.0,173.0
4,nm0000005,Ingmar Bergman,Ernst Ingmar Bergman,1918.0,2007.0,179.0

In [34]:
#Inspect name table for column type
final_name.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 173127 entries, 0 to 175714
Data columns (total 6 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   person_id    173127 non-null  object
 1   person_name  173127 non-null  object
 2   birth_name   173127 non-null  object
 3   birth_year   74487 non-null   float64
 4   death_year   26639 non-null   float64
 5   height       29784 non-null   float64
dtypes: float64(3), object(3)
memory usage: 9.2+ MB

## job_title table

In [35]:
#Create lists for job title id and job title
job_title_id = ['jt001', 'jt002', 'jt003']
job_title = ['actor', 'director', 'writer']

#Convert list to DataFrame
job_title_df = pd.DataFrame(list(zip(job_title_id, job_title)), 
               columns =['job_title_id', 'job_title'])
job_title_df.head()

  job_title_id job_title
0        jt001     actor
1        jt002  director
2        jt003    writer

# MOVIES FILE

In [36]:
# Inspect movies CSV
imdb_movies.head()

,imdb_title_id,title,original_title,year,date_published,genre,duration,country,language,director,...,actors,description,avg_vote,votes,budget,usa_gross_income,worlwide_gross_income,metascore,reviews_from_users,reviews_from_critics
0,tt0000574,The Story of the Kelly Gang,The Story of the Kelly Gang,1906,1906-12-26,"Biography, Crime, Drama",70,Australia,NaN,Charles Tait,...,"Elizabeth Tait, John Tait, Norman Campbell, Be...",True story of notorious Australian outlaw Ned ...,6.1,537,$ 2250,NaN,NaN,NaN,7.0,7.0
1,tt0001892,Den sorte drøm,Den sorte drøm,1911,1911-08-19,Drama,53,"Germany, Denmark",NaN,Urban Gad,...,"Asta Nielsen, Valdemar Psilander, Gunnar Helse...",Two men of high rank are both wooing the beaut...,5.9,171,NaN,NaN,NaN,NaN,4.0,2.0
2,tt0002101,Cleopatra,Cleopatra,1912,1912-11-13,"Drama, History",100,USA,English,Charles L. Gaskill,...,"Helen Gardner, Pearl Sindelar, Miss Fielding, ...",The fabled queen of Egypt's affair with Roman ...,5.2,420,$ 45000,NaN,NaN,NaN,24.0,3.0
3,tt0002130,L'Inferno,L'Inferno,1911,1911-03-06,"Adventure, Drama, Fantasy",68,Italy,Italian,"Francesco Bertolini, Adolfo Padovan",...,"Salvatore Papa, Arturo Pirovano, Giuseppe de L...",Loosely adapted from Dante's Divine Comedy and...,7.0,2019,NaN,NaN,NaN,NaN,28.0,14.0
4,tt0002199,"From the Manger to the Cross; or, Jesus of Naz...","From the Manger to the Cross; or, Jesus of Naz...",1912,1913,"Biography, Drama",60,USA,English,Sidney Olcott,...,"R. Henderson Bland, Percy Dyer, Gene Gauntier,...","An account of the life of Jesus Christ, based ...",5.7,438,NaN,NaN,NaN,NaN,12.0,5.0

## movie table

In [37]:
# Return wanted columns for movie table
movie_columns = ['imdb_title_id', 'title', 'year', 'duration', 'description', 'votes', 'avg_vote']
new_movie_df = imdb_movies[movie_columns].copy()
new_movie_df.head()

,imdb_title_id,title,year,duration,description,votes,avg_vote
0,tt0000574,The Story of the Kelly Gang,1906,70,True story of notorious Australian outlaw Ned ...,537,6.1
1,tt0001892,Den sorte drøm,1911,53,Two men of high rank are both wooing the beaut...,171,5.9
2,tt0002101,Cleopatra,1912,100,The fabled queen of Egypt's affair with Roman ...,420,5.2
3,tt0002130,L'Inferno,1911,68,Loosely adapted from Dante's Divine Comedy and...,2019,7.0
4,tt0002199,"From the Manger to the Cross; or, Jesus of Naz...",1912,60,"An account of the life of Jesus Christ, based ...",438,5.7

In [38]:
# Rename the column headers
transform_movie_df = new_movie_df.rename(columns={'imdb_title_id': 'movie_id',
                                                 'title': 'movie_title',
                                                 'year': 'year_published',
                                                 'duration': 'movie_duration',
                                                 'votes': 'votes_count',
                                                 'avg_vote': 'votes_avg'})

# Clean the data by dropping duplicates and setting the index
transform_movie_df.drop_duplicates("movie_id", inplace=True)
transform_movie_df.set_index("movie_id", inplace=True)

transform_movie_df.head()

,movie_title,year_published,movie_duration,description,votes_count,votes_avg
movie_id,,,,,,
tt0000574,The Story of the Kelly Gang,1906,70,True story of notorious Australian outlaw Ned ...,537,6.1
tt0001892,Den sorte drøm,1911,53,Two men of high rank are both wooing the beaut...,171,5.9
tt0002101,Cleopatra,1912,100,The fabled queen of Egypt's affair with Roman ...,420,5.2
tt0002130,L'Inferno,1911,68,Loosely adapted from Dante's Divine Comedy and...,2019,7.0
tt0002199,"From the Manger to the Cross; or, Jesus of Naz...",1912,60,"An account of the life of Jesus Christ, based ...",438,5.7

## Directors

In [39]:
# Return only directors and movie title id's
director_df = imdb_movies[['imdb_title_id', 'director']].copy()
director_df.head()

  imdb_title_id                             director
0     tt0000574                         Charles Tait
1     tt0001892                            Urban Gad
2     tt0002101                   Charles L. Gaskill
3     tt0002130  Francesco Bertolini, Adolfo Padovan
4     tt0002199                        Sidney Olcott

In [40]:
# Rename the column headers
transform_director_df = director_df.rename(columns={'imdb_title_id': 'movie_id',
                                                     'director': 'person_name'})

# Split person_name column by comma and insert it as new row
new_director_df = transform_director_df.assign(person_name=transform_director_df.person_name.str.split(', ')).explode('person_name')

# Add job title id to all rows
new_director_df['job_title_id'] ='jt002'
new_director_df.head()

    movie_id          person_name job_title_id
0  tt0000574         Charles Tait        jt002
1  tt0001892            Urban Gad        jt002
2  tt0002101   Charles L. Gaskill        jt002
3  tt0002130  Francesco Bertolini        jt002
3  tt0002130       Adolfo Padovan        jt002

In [41]:
#Map person name to name DataFrame and add column person_id
new_director_df['person_id'] = new_director_df['person_name'].map(final_name.set_index('person_name')['person_id'])

#Drop person name column to form first part of movie_person_title_junction table
final_director = new_director_df.drop(columns='person_name')
final_director.head()

    movie_id job_title_id  person_id
0  tt0000574        jt002  nm0846879
1  tt0001892        jt002        NaN
2  tt0002101        jt002  nm0309130
3  tt0002130        jt002  nm0078205
3  tt0002130        jt002  nm0655824

## Writers

In [42]:
# Return only writers and movie title id's
writer_df = imdb_movies[['imdb_title_id', 'writer']].copy()
writer_df.head()

  imdb_title_id                                 writer
0     tt0000574                           Charles Tait
1     tt0001892  Urban Gad, Gebhard Schätzler-Perasini
2     tt0002101                       Victorien Sardou
3     tt0002130                        Dante Alighieri
4     tt0002199                          Gene Gauntier

In [43]:
# Rename the column headers
transform_writer_df = writer_df.rename(columns={'imdb_title_id': 'movie_id',
                                                     'writer': 'person_name'})

# Split person_name column by comma and insert it as new row
new_writer_df = transform_writer_df.assign(person_name=transform_writer_df.person_name.str.split(', ')).explode('person_name')

# Add job title id to all rows
new_writer_df['job_title_id'] ='jt003'
new_writer_df.head()

    movie_id                 person_name job_title_id
0  tt0000574                Charles Tait        jt003
1  tt0001892                   Urban Gad        jt003
1  tt0001892  Gebhard Schätzler-Perasini        jt003
2  tt0002101            Victorien Sardou        jt003
3  tt0002130             Dante Alighieri        jt003

In [44]:
#Map person name to name DataFrame and add column person_id
new_writer_df['person_id'] = new_writer_df['person_name'].map(final_name.set_index('person_name')['person_id'])

#Drop person name column to form second part of movie_person_title_junction table
final_writer = new_writer_df.drop(columns='person_name')
final_writer.head()

    movie_id job_title_id  person_id
0  tt0000574        jt003  nm0846879
1  tt0001892        jt003        NaN
1  tt0001892        jt003        NaN
2  tt0002101        jt003  nm0765026
3  tt0002130        jt003  nm0019604

## Actors

In [45]:
# Return only actors and movie title id's
actor_df = imdb_movies[['imdb_title_id', 'actors']].copy()
actor_df.head()

  imdb_title_id                                             actors
0     tt0000574  Elizabeth Tait, John Tait, Norman Campbell, Be...
1     tt0001892  Asta Nielsen, Valdemar Psilander, Gunnar Helse...
2     tt0002101  Helen Gardner, Pearl Sindelar, Miss Fielding, ...
3     tt0002130  Salvatore Papa, Arturo Pirovano, Giuseppe de L...
4     tt0002199  R. Henderson Bland, Percy Dyer, Gene Gauntier,...

In [46]:
# Rename the column headers
transform_actor_df = actor_df.rename(columns={'imdb_title_id': 'movie_id',
                                                     'actors': 'person_name'})

# Split person_name column by comma and insert it as new row
new_actor_df = transform_actor_df.assign(person_name=transform_actor_df.person_name.str.split(', ')).explode('person_name')

# Add job title id to all rows
new_actor_df['job_title_id'] ='jt001'
new_actor_df.head()

    movie_id      person_name job_title_id
0  tt0000574   Elizabeth Tait        jt001
0  tt0000574        John Tait        jt001
0  tt0000574  Norman Campbell        jt001
0  tt0000574       Bella Cola        jt001
0  tt0000574       Will Coyne        jt001

In [47]:
#Map person name to name DataFrame and add column person_id
new_actor_df['person_id'] = new_actor_df['person_name'].map(final_name.set_index('person_name')['person_id'])

#Drop person name column to form last part of movie_person_title_junction table
final_actor = new_actor_df.drop(columns='person_name')
final_actor.head()

    movie_id job_title_id  person_id
0  tt0000574        jt001  nm0846887
0  tt0000574        jt001  nm0846894
0  tt0000574        jt001  nm3002376
0  tt0000574        jt001  nm0170118
0  tt0000574        jt001        NaN

## movie_person_title_junction table

In [48]:
# Combine director, writer, actor DataFrames
combined_df = pd.concat([final_director, final_writer, final_actor], axis=0)

# Drop rows with no person_id
junction_df = combined_df.dropna(subset=['person_id'])
junction_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 766171 entries, 0 to 81272
Data columns (total 3 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   movie_id      766171 non-null  object
 1   job_title_id  766171 non-null  object
 2   person_id     766171 non-null  object
dtypes: object(3)
memory usage: 23.4+ MB

In [49]:
# Create unique id with all 3 columns as name
junction_df.loc[:,'unique_id']=junction_df.movie_id.astype(str) + '_' +\
    junction_df.job_title_id.astype(str) + '_' + junction_df.person_id.astype(str)

# Drop duplicates
junction_df.drop_duplicates("unique_id", inplace=True)

# Drop unique_id column
final_junction = junction_df.drop(columns='unique_id')
final_junction.info()

C:\ProgramData\Anaconda3\envs\PythonData\lib\site-packages\pandas\core\indexing.py:845: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.obj[key] = _infer_fill_value(value)
C:\ProgramData\Anaconda3\envs\PythonData\lib\site-packages\pandas\core\indexing.py:966: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.obj[item] = s

<class 'pandas.core.frame.DataFrame'>
Int64Index: 761109 entries, 0 to 81272
Data columns (total 3 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   movie_id      761109 non-null  object
 1   job_title_id  761109 non-null  object
 2   person_id     761109 non-null  object
dtypes: object(3)
memory usage: 23.2+ MB

<ipython-input-49-16af18f2ac4e>:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  junction_df.drop_duplicates("unique_id", inplace=True)

In [50]:
final_mpt_junction = final_junction[['movie_id', 'person_id', 'job_title_id']]
final_mpt_junction.head()

    movie_id  person_id job_title_id
0  tt0000574  nm0846879        jt002
2  tt0002101  nm0309130        jt002
3  tt0002130  nm0078205        jt002
3  tt0002130  nm0655824        jt002
4  tt0002199  nm0646058        jt002

### Create database connection

In [51]:
connection_string = f'{username}:{password}@localhost:5432/movies_db'
engine = create_engine(f'postgresql://{connection_string}')

NameError: name 'username' is not defined

In [ ]:
# Confirm tables
engine.table_names()

### Load DataFrames into database

In [ ]:
#Load movie DF into SQL
transform_movie_df.to_sql(name='movie', con=engine, if_exists='append', index=True)

In [ ]:
#Load person DF into SQL
final_name.to_sql(name='person', con=engine, if_exists='append', index=False)

In [ ]:
#Load job_title DF into SQL
job_title_df.to_sql(name='job_title', con=engine, if_exists='append', index=False)

In [52]:
#Load movie_person_title_junction DF into SQL
final_mpt_junction.to_sql(name='movie_person_title_junction', con=engine, if_exists='append', index=False)

NameError: name 'engine' is not defined

# Shanker's code

In [53]:
imdb_movies_filt = imdb_movies[['imdb_title_id','genre']]
imdb_movies_filt

      imdb_title_id                      genre
0         tt0000574    Biography, Crime, Drama
1         tt0001892                      Drama
2         tt0002101             Drama, History
3         tt0002130  Adventure, Drama, Fantasy
4         tt0002199           Biography, Drama
...             ...                        ...
81268     tt9903716           Horror, Thriller
81269     tt9905412                      Drama
81270     tt9905462                      Drama
81271     tt9911774                      Drama
81272     tt9914286              Drama, Family

[81273 rows x 2 columns]

In [54]:
def unique_col(col):
    return col.split(',')

In [55]:
genre_list1 = imdb_movies_filt.genre.apply(unique_col)

In [56]:
genre_list2 = []
for a in genre_list1:
    a = [x.strip(' ') for x in a]
    #print(a)
    genre_list2 = genre_list2 + a

In [57]:
genre_list3 = list(set(genre_list2))

df1 = pd.DataFrame(genre_list3,columns=['genre_name'])

In [58]:
def key_genre(col):
    return col[0:2] + '_g_' + col[-1]

In [59]:
df1['genre_id'] = df1.genre_name.apply(key_genre)
genre = df1

In [60]:
imdb_movies_filt.set_index('imdb_title_id', inplace=True)

In [61]:
d = []
for a,b in imdb_movies_filt.iterrows():
    #print(a)
    #print(b)
    
    
    #c = b.str.split(',')
    #c = [x.strip(' ') for x in c]
    
    
    c = [x.strip(' ').split(',') for x in b]
    c = c[0]
    c = [x.strip(' ') for x in c]
    #print(c)
    
    
    for x in c:
        #print(a)
        #print(x)
        d.append({
            'movie_id': a,
            'genre_name': x})

df2_a = pd.DataFrame(d)
df2 = pd.merge(df2_a, df1)

In [62]:
movie_genre_junction = df2[['movie_id','genre_id']]
movie_genre_junction

         movie_id genre_id
0       tt0000574   Bi_g_y
1       tt0002199   Bi_g_y
2       tt0002423   Bi_g_y
3       tt0005960   Bi_g_y
4       tt0007801   Bi_g_y
...           ...      ...
166216  tt0443057   Do_g_y
166217  tt0248194   Re_g_V
166218  tt0378456   Re_g_V
166219  tt2088950   Ga_g_w
166220  tt2606314   Ne_g_s

[166221 rows x 2 columns]

In [63]:
genre

     genre_name genre_id
0         Drama   Dr_g_a
1          News   Ne_g_s
2     Game-Show   Ga_g_w
3         Music   Mu_g_c
4     Biography   Bi_g_y
5        Action   Ac_g_n
6       Mystery   My_g_y
7        Sci-Fi   Sc_g_i
8         Adult   Ad_g_t
9   Documentary   Do_g_y
10    Film-Noir   Fi_g_r
11          War   Wa_g_r
12       Comedy   Co_g_y
13        Crime   Cr_g_e
14      Musical   Mu_g_l
15    Adventure   Ad_g_e
16   Reality-TV   Re_g_V
17      Fantasy   Fa_g_y
18       Family   Fa_g_y
19      History   Hi_g_y
20    Animation   An_g_n
21     Thriller   Th_g_r
22      Romance   Ro_g_e
23       Horror   Ho_g_r
24        Sport   Sp_g_t
25      Western   We_g_n